_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
E_0_conv (Conv2D)            (None, 320, 1, 6)         36        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 320, 1, 6)         0         
_________________________________________________________________
E_1_maxpool (MaxPooling2D)   (None, 80, 1, 6)          0         
_________________________________________________________________
E_2_conv (Conv2D)            (None, 80, 1, 6)          186       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 80, 1, 6)          0         
_________________________________________________________________
E_3_maxpool (MaxPooling2D)   (None, 20, 1, 6)          0         
_________________________________________________________________
E_4_conv (Conv2D)            (None, 20, 1, 6)          186       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 20, 1, 6)          0         
_________________________________________________________________
E_5_maxpool (MaxPooling2D)   (None, 5, 1, 6)           0         
_________________________________________________________________
D_6_conv (Conv2D)            (None, 5, 1, 6)           186       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 5, 1, 6)           0         
_________________________________________________________________
D_7_upsample (Conv2DTranspos (None, 20, 1, 6)          186       
_________________________________________________________________
D_8_upsample (Conv2DTranspos (None, 80, 1, 6)          186       
_________________________________________________________________
D_9_upsample (Conv2DTranspos (None, 320, 1, 6)         186       
_________________________________________________________________
D_10_final (Dense)           (None, 320, 1, 1)         7         
=================================================================
Total params: 1,159
Trainable params: 1,159
Non-trainable params: 0
_________________________________________________________________
